In [1]:
import numpy as np
import pandas as pd

df = pd.DataFrame(np.random.randn(6, 4), index=pd.date_range('20220101', periods=6), columns=['A', 'B', 'C', 'D'])
df2 = df.copy()
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2.shift(1)

                   A         B         C         D      E
2022-01-01       NaN       NaN       NaN       NaN   None
2022-01-02 -1.842202 -1.595479  0.612203 -0.783430    one
2022-01-03  0.547124 -1.529413  0.393284  0.452589    one
2022-01-04 -0.152954  1.975108  2.085919  0.076100    two
2022-01-05  0.548813  1.390313 -1.655576 -0.295375  three
2022-01-06  0.807717  0.441708  0.058698 -0.329975   four